Repository: 84000/data-translation-memory
Catalog: toh263-v3.tmx
Source language: bo
Languages: en

source: འགྲོའོ་ཞེས་བྱ་བ་ཤི་བའི་ཆུ་བོ་ལས་རྒལ་བ་འདི་ནི་བཟོད་པ་སྒོམ་པའོ་ཞེས་སྨྲས་སོ། །
en: When the term going refers to crossing over the river of death, it expresses the cultivation of this acceptance.

source: རིགས་ཀྱི་བུ་འོང་ངོ་ཞེས་བྱ་བ་མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པར་འཇུག་པའི་གནས་ཀྱི་མཚན་ཉིད་འདི་ནི་བཟོད་པ་སྒོམ་པ་མ་ཡིན་ནོ། །
en: “Noble son, when the term coming refers to the characteristics of the state of pursuing misery, lamentation, unhappiness, and distress, this is not the cultivation of this acceptance.

source: འགྲོའོ་ཞེས་བྱ་བ་སྡུག་བསྔལ་བ་དང་། འཁྲུག་པ་ཐམས་ཅད་ཉེ་བར་ཞི་བ་འདི་ནི་བཟོད་པ་སྒོམ་པའོ་ཞེས་སྨྲས་སོ། །
en: When the term going refers to the pacification of all forms of suffering and distress, it expresses the cultivation of this acceptance.

source: རིགས་ཀྱི་བུ་འོང་ངོ་ཞེས་བྱ་བ་འདུ་བྱེད་ཀྱི་སྡུག་བསྔལ་ཐམས་ཅད་སྐྱེ་བ་དང་། རྒ་ཤི་དང་འཆི་འཕོ་སྐྱེ་བ་དང་། ཕྲད་པ་དང་། འབྲལ་བའི་སྡུག་བསྔལ་སྐྱེ་བའི་གནས་ཀྱི་མཚན་ཉིད་འདི་ནི་བཟོད་པ་སྒོམ་པ་མ་ཡིན་ནོ། །
en: “Noble son, when the term coming refers to the characteristics of the state of the arising of all manner of suffering associated with formations; the arising of old age, death, and transmigration; and the arising of the suffering associated with meeting and parting, this is not the cultivation of this acceptance.

source: འགྲོའོ་ཞེས་བྱ་བ་འདུ་བྱེད་ཀྱི་སྡུག་བསྔལ་ཐམས་ཅད་ཉེ་བར་ཞི་བ་འདི་ནི་བཟོད་པ་སྒོམ་པའོ། །
en: When the term going refers to the pacification of all forms of suffering associated with formations, this is the cultivation of this acceptance.

source: རིགས་ཀྱི་བུ་འོང་ངོ་ཞེས་བྱ་བ་ནི་སྡུག་བསྔལ་ཐམས་ཅད་སྐྱེ་ཞིང་ཕྱིན་ཅི་ལོག་བཞི་ཀུན་ནས་ལྡང་བའི་རང་བཞིན་ཏེ། དགེ་བ་ཐམས་ཅད་སྒོམ་པ་ལ་གེགས་བྱེད་པའོ། །
en: “Noble son, when the term coming refers to the arising of all manner of suffering and the nature of the generation of the four mistaken views, it hinders the cultivation of all manner of virtues.

source: རིགས་ཀྱི་བུ་འགྲོའོ་ཞེས་བྱ་བ་ནི་ཐམས་ཅད་ཉེ་བར་ཞི་བའོ། །སྡུག་བསྔལ་གྱི་ཕྱིན་ཅི་ལོག་གི་གཉེན་པོའོ། །
en: Noble son, the term going refers to complete pacification and is the antidote to the mistaken views associated with suffering.

source: རིགས་ཀྱི་བུ་དེ་བས་ན་འོང་ངོ་ཞེས་བྱ་བའི་ཚིག་ནི་ཉོན་མོངས་པ་ཐམས་ཅད་ཀུན་ཏུ་འདྲེན་པའོ་ཞེས་སྨྲས་པ་ཡིན་ནོ། །འགྲོའོ་ཞེས་བྱ་བ་ནི་ཉོན་མོངས་པའི་བག་ཆགས་ཀྱི་རྗེས་སུ་འབྲེལ་པ་ཐམས་ཅད་འདྲེན་པ་མེད་པའོ་ཞེས་སྨྲས་པ་ཡིན་ནོ། །
en: Therefore, noble son, the term coming is an expression of something that leads to all forms of affliction, while the term going is a term that expresses something that does not lead to any association with the habitual tendencies of the afflictions.

source: རིགས་ཀྱི་བུ་དེ་བས་ན་བརྗོད་དུ་མེད་པ་ལ་གཡོ་བ་མེད་དོ། །
en: “Therefore, noble son, bodhisattvas do not waver from the inexpressible.

source: བརྗོད་པ་ཐམས་ཅད་ལ་ཡང་ཆགས་པ་མེད་དོ། །
en: They are not attached to any expression.

source: ཡི་གེའི་ཆོས་ཀྱི་དབྱིངས་ལ་འཁྲུག་པ་མེད་དོ། །བཟུང་བ་མེད་པ་དང་། ཀུན་ནས་ལྡང་བ་མེད་པ་དང་།
en: They do not argue about the realm of phenomena of words.

source: ལུས་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་། འདུ་བྱེད་ཐམས་ཅད་ལ་དམིགས་པའི་རྒྱུན་ཆད་པ་དང་། ཡོད་པར་རྟོག་པ་དང་། མེད་པར་རྟོག་པ་དང་བྲལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་བཟོད་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: A bodhisattva for whom there are no apprehended objects, no arising, no body, and no origination, who has cut the stream of observing all manner of perceptions and is free from the concepts of existence and nonexistence, perfects this acceptance.”

source: བྱང་ཆུབ་སེམས་དཔའ་དགྲ་རྣམ་པར་འགྲེལ་བས་འདི་སྟོན་པ་བསྟན་པ་ན་སྔོན་དུ་འགྲོ་བ་ལག་བཟངས་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུ་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པ་ཐོབ་བོ། །
en: As this teaching was being delivered by the bodhisattva Uncovering the Enemies, 99 sextillion bodhisattvas led by Subāhu achieved the acceptance of the unborn nature of phenomena.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དང་ལྡན་པ་ས་དང་ནམ་མཁའ་ཁྱབ་པ་འདི་ལ་གནས་པས་མགྲིན་གཅིག་ཏུ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། རིགས་ཀྱི་བུ་ཇི་ལྟ་བུར་ཁྱོད་ཀྱང་ཆོས་ཟབ་མོའི་ཚུལ་གྱི་རྗེས་སུ་ཞུགས་ཤིང་བྱང་ཆུབ་སེམས་དཔའི་ཀུན་ནས་ཡོན་ཏན་རྣམ་པར་རོལ་པ་མངོན་པར་ཤེས་པ་ཆགས་པ་མེད་པའི་སྤོབས་པ་དང་ལྡན་པ་གང་གི་ཕྱིར་ཁྱོད་ཀྱིས་བདག་ཅག་ལ་འདི་འདྲ་བའི་ཆོས་ཀྱི་ཆར་རབ་ཏུ་ཕབ་པ་ལེགས་སོ་ལེགས་སོ། །དེ་ཉིད་ཀྱི་ཚེ་ན་ཕྱོགས་བཅུ་ནས་འདུས་པའི་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་།
en: All the beings who dwelt on land and in the sky in the entire buddha realm applauded in unison, exclaiming, “Noble son, the way that you have set forth this profound method of Dharma and showered us with such a rain of Dharma so that we are filled with eloquence regarding reveling in the complete qualities of a bodhisattva, the supernormal faculties, and nonattachment is excellent!”

source: མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་མང་པོ་ལྷ་རྣམས་ཀྱི་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། དྲི་དང་། བྱུག་པས་བྱང་ཆུབ་སེམས་དཔའ་དགྲ་རྣམ་པར་འགྲེལ་པ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་འདུན་ཅིང་བརྩོན་ནོ། །
en: At that moment the many gods, nāgas, yakṣas, asuras, garuḍas, kinnaras, and mahoragas who had gathered from the ten directions yearned and were determined to perform an offering to the bodhisattva Uncovering the Enemies with divine flowers, garlands, perfumes, and ointments.

source: དེའི་ལུས་ལ་མེ་ཏོག་དང་། ཕྲེང་བ་དང་། དྲི་དང་། བྱུག་པས་གཏོར་བས་རིགས་ཀྱི་བུ་ཡང་དེ་ལྟར་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ཀྱིས་རིན་པོ་ཆེ་སྣ་ཚོགས་སུ་བྱིན་གྱིས་བརླབས་ཏེ་ཕུང་པོ་ཕྱོགས་གཅིག་ཏུ་བཞག་ནས།
en: As they scattered flowers, garlands, perfumes, and ointments on his body, that noble son used the power of his absorption to magically transform them into the various precious substances.

source: བཅོམ་ལྡན་འདས་ཀྱི་སླད་དུ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་སེང་གེའི་ཁྲི་འཕང་དུ་དཔག་ཚད་སྟོང་ཞེང་དུ་དཔག་ཚད་བཅུ་པ་ལྷ་རྫས་ཀྱི་གོས་ཀྱིས་བཏིང་བ། བལྟ་ན་སྡུག་པ་རྣམ་པ་སྣ་ཚོགས་བྱུང་ངོ་། །སངས་རྒྱས་ཀྱི་ཞིང་འདིར་མུ་སྟེགས་ཅན་གཞན་དཀའ་ཐུབ་དང་། བརྟུལ་ཞུགས་དང་། སྤྱོད་པ་དང་། སྤྱོད་ལམ་ལ་བརྩོན་པར་བྱིན་གྱིས་བརླབས་པ་ཇི་སྙེད་པ་དང་། གང་ཡང་ཕྱོགས་བཅུའི་ཞིང་སྟོང་པ་དང་།
en: The pile fell to one side and transformed into a lion throne for the Blessed One made of the seven precious gems that was a thousand leagues high and ten leagues wide, covered with divine fabrics, and delightful to behold.

source: རྙོག་པ་ལྔའི་སངས་རྒྱས་ཀྱི་ཞིང་མཐའ་ཡས་མུ་མེད་པ་ན་མུ་སྟེགས་གཞན་དཀའ་ཐུབ་དང་། བརྟུལ་ཞུགས་དང་། སྤྱོད་པ་དང་། སྤྱོད་ལམ་ལ་བརྩོན་པ་བྱིན་གྱིས་བརླབས་པ། དཀའ་ཐུབ་ངན་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་སེང་གེའི་ཁྲི་ཡང་དག་པར་མཐོང་ངོ་། །
en: All of the followers of lowly ascetic practices—the non-Buddhists and followers of other ascetic orders in this buddha realm who had resolved to exert themselves in observances, rules of conduct, and the four modes of conduct, as well as the non-Buddhists and followers of other ascetic orders who had resolved to exert themselves in observances, rules of conduct, and the four positions in countless realms throughout the ten directions that are empty of buddhas or inundated with the five impurities—gazed upon this lion throne made of the seven precious substances.

source: ལ་ལ་དཀའ་ཐུབ་ལྔ་པ་དག་ཉི་མ་དང་ཟླ་བ་ལ་ཕྱག་འཚལ་བར་ཡང་དག་པར་མཐོང་ངོ་། །ལ་ལ་ཆུ་འཛིན་པ་དང་། ལ་ལ་འདམ་འཛིན་པ་དང་། ཆུ་དང་འདམ་འཛིན་པ་དང་། ལ་ལ་སྐྲ་འཛིན་པ་དང་། ཨག་ཚོམ་འཛིན་པ་དང་། སྐྲ་དང་ཨག་ཚོམ་འཛིན་པ་དང་། ལ་ལ་རྐང་པ་འདེགས་པ་དང་། ལག་པ་འདེགས་པ་དང་། ལ་ལ་ནགས་ཚལ་གྱི་རྩ་བ་དང་འདབ་མ་ཟ་བ་དང་། ཚེར་མའི་སྟེང་དུ་ཉལ་བ་དང་། ལ་ལ་རུས་པའི་ཕྱེ་མས་ལུས་བསྐུས་པ་དང་། མིའི་མགོ་བོའི་ཕྲེང་བ་དང་། མགོ་ལག་མཐིལ་ན་འཆང་བ་ཡང་དག་པར་མཐོང་ངོ་། །ལ་ལ་ཕྱུགས་ཀྱི་བརྟུལ་ཞུགས་ཅན་དང་། ཁྱིའི་བརྟུལ་ཞུགས་ཅན་དང་། ཕག་གི་བརྟུལ་ཞུགས་ཅན་དང་། རི་དགས་ཀྱི་བརྟུལ་ཞུགས་ཅན་དང་།
en: Some who were engaging in the five-fires ascetic practice could be seen prostrating to the sun and the moon; some were carrying water, some were carrying mud, and some were carrying water and mud; some had long hair, some had beards, and some had long hair and beards; some were standing on one foot or raising one arm; some were feeding on forest roots and leaves; some were lying on nails; some had smeared their bodies with ashes from bones; some wore garlands of human skulls; and some were seen holding skulls in the palms of their hands.

source: བྱའི་བརྟུལ་ཞུགས་ཅན་དང་། མེའི་བརྟུལ་ཞུགས་ཅན་དང་། ཟླ་བའི་བརྟུལ་ཞུགས་ཅན་དང་། ཉི་མའི་བརྟུལ་ཞུགས་ཅན་དང་། ཆུའི་བརྟུལ་ཞུགས་ཅན་དང་། འཛེག་པའི་བརྟུལ་ཞུགས་ཅན་དང་། དཀའ་ཐུབ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་ནད་གསོས། དེ་ལ་སོགས་པ་མུ་སྟེགས་ཅན་གཞན་ལ་ལ་དཀའ་ཐུབ་དང་།
en: There were other non-Buddhists there as well who practiced the staff observance, the dog observance, the pig observance, the deer observance, the bird observance, the fire observance, the moon observance, the sun observance, the water observance, the ladder observance, and various ascetic healing practices, and even more who had mastered exerting themselves in ascetic practices, observances, rules of conduct, and the four positions.

source: བརྟུལ་ཞུགས་དང་། སྤྱོད་པ་དང་། སྤྱོད་ལམ་ལ་བརྩོན་པར་བྱིན་གྱིས་བརླབས་པ། དཀའ་ཐུབ་ངན་པ་སྣ་ཚོགས་དེ་དག་ཐམས་ཅད་དེའི་ཚེ་ན། དེར་སེང་གེའི་ཁྲི་ཡང་དག་པར་མཐོང་ངོ་། །
en: At that time all of those various practitioners of lowly ascetic practices were seen there at the lion throne.

source: སེང་གེའི་ཁྲི་དེའི་སྟེང་གི་བར་སྣང་ན་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་གདུགས་ཞེང་དུ་དཔག་ཚད་སྟོང་ཕྲག་བཅུ་པར་བྱིན་གྱིས་བརླབས་སོ། །གདུགས་དེ་ལ་ལྷ་རྫས་ཀྱི་རིན་པོ་ཆེའི་རྒྱན་སྣ་ཚོགས་སུ་ཡང་དག་པར་མཐོང་ངོ་། །
en: A parasol made of the seven precious substances that was ten thousand leagues wide hung in the sky above the lion throne, and on that parasol one could see various types of ornaments made of celestial gems.

source: རྒྱན་དེ་དག་ལས་ལོག་པའི་ཚིག་གི་ཐ་སྙད་སྣ་ཚོགས་བྱུང་བ་ནི་འདི་ལྟ་སྟེ། ཆད་པར་ལྟ་བ་དང་། རྟག་པར་ལྟ་བ་དང་། འཇིག་ཚོགས་ཀྱི་ལྟ་བ་དང་། མཐར་འཛིན་པའི་ལྟ་བ་དང་། ཚུལ་ཁྲིམས་དང་བརྟུལ་ཞུགས་སྙེམས་པའི་ལྟ་བ་དང་།
en: Various conventional names of wrong views resounded from those ornaments.

source: འདོད་པ་ལ་བདེ་བ་སྐྱེ་བའི་ལྟ་བ་བྱུང་ངོ་། །འཐབ་ཅིང་གཅིག་ལ་གཅིག་འཚོག་པ་དང་། མགོ་གཅོད་པ་དང་། མིག་འབྱིན་པའི་ལྟ་བ་དང་། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དུ་ལྟ་བ་སྤྲོས་པས་ལྟ་བར་སོང་བ་དྲུག་ཅུ་རྩ་གཉིས་ཀྱི་ལྟ་བའི་ཚིག་གི་ཐ་སྙད་ཀྱི་དབྱངས་བྱུང་ངོ་། །
en: For instance, they emitted the sounds of the conventional names of the sixty-two wrong views, such as the view of annihilation; the view of permanence; the view of the transitory collection; the view that holds extreme beliefs; the view that regards discipline and observances as superior; the view that happiness arises on the basis of desire; the view of disputing and finding fault with one another, cutting off heads, and gouging out the eyes; and the view by which one abandons the view regarding the path of the ten virtuous actions.

source: གང་ཡང་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ཚད་མེད་གྲངས་མེད་པ་དག་ནས་སངས་རྒྱས་ཀྱི་ཞིང་འདིར་ལྷགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་སྒྲ་དེ་ཉན་ཏོ། །སེང་གེའི་ཁྲི་ལ་སེམས་ཅན་ཚུལ་ཁྲིམས་དང་། བརྟུལ་ཞུགས་ངན་པ་སྣ་ཚོགས་སྦྱོར་བའི་རྗེས་སུ་ལྡན་པ་དེ་དག་ཀྱང་ལྟའོ། །
en: All the bodhisattvas who had arrived in this buddha realm from the infinite, countless pure buddha realms in the ten directions heard those sounds and saw those beings at the lion throne who were engaged in those various types of unwholesome customs and observances.

source: ཀྱེ་མ་ཀྱི་ཧུད་ལྟ་བ་ཉོན་མོངས་པ་ཐོབ་པ་འདི་དག་རྙོག་པ་ལྔའི་མི་མཇེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་ཡང་དག་པར་མཐོང་བ་གང་ཞིག་ཅེས་དེ་མཆོག་ཏུ་སྐྱོ་བའི་ཡིད་ཀྱིས་འདི་སྙམ་དུ་སེམས་པར་གྱུར་ཏོ། །
en: They became utterly disheartened and thought, “Alas! Who are those beings holding afflicted views that we see in this Sahā buddha realm, which is inundated with the five impurities?

source: བདག་ཅག་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོའོ་སྙམ་སྟེ།
en: We should return to our respective buddha realms!”

source: དེ་དག་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ལས་འགྲོ་བར་འདོད་ཀྱང་དེ་དག་རང་རང་གི་ཕྱོགས་གང་དུ་འགྲོ་བར་མི་ཤེས་ནས། དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་དགྲ་རྣམ་པར་འགྲེལ་པ་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་ཏེ་ཕྱག་འཚལ་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Although they wanted to leave this buddha realm, they did not know which way to go to their respective realms, so they prostrated to the bodhisattva Uncovering the Enemies with their palms together and said, “Noble son, we want to leave this buddha realm and return to our respective buddha realms.

source: རིགས་ཀྱི་བུ་བདག་ཅག་ནི་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ནས་རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་བར་འདོད་པ་ནི་རིགས་ཀྱི་བུ་སངས་རྒྱས་ཀྱི་ཞིང་འདི་ཤིན་ཏུ་ལྟ་བ་སྟུག་པོས་བསྒྲིབས་ཤིང་དོག་པ་ཐོབ་པས། བདག་ཅག་ཀྱང་ཅུང་ཟད་ལུས་དང་ངག་དང་། ཡིད་ཀྱིས་འཕྲུལ་པར་འགྱུར་བ་དེའི་ཕྱིར་བདག་ཅག་མྱུར་དུ་འགྲོ་བར་འདོད་དོ། །
en: Noble son, since this buddha realm is utterly obscured by inexplicable views and elicits doubt, even the slightest of our bodily, verbal, and mental actions will be misunderstood, so we want to leave immediately.

source: བདག་ཅག་ཀྱང་ཕྱོགས་ཐམས་ཅད་མགོ་འཁོར་བར་གྱུར་ནས། ཡང་བདག་ཅག་རང་རང་གི་ཕྱོགས་གང་དུ་འགྲོ་བ་མི་ཤེས་ན།
en: But we have lost our sense of direction and we do not know which way to go to our respective realms.

source: དེའི་ཕྱིར་རིགས་ཀྱི་བུ་ཁྱོད་བདག་ཅག །རང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་བར་ནུས་པ་ཉམས་སུ་ལོངས་ཤིག །
en: Noble son, please enable us to return to our respective buddha realms!”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དགྲ་རྣམ་པར་འགྲེལ་བས་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་ལྷགས་པ་དེ་དག་ལ་སྨྲས་པ། རིགས་ཀྱི་བུ་ཅི་ཁྱེད་ཅག་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་མ་ཞུགས་སམ། སྨྲས་པ།
en: The bodhisattva Uncovering the Enemies replied to those bodhisattvas who had come from the buddha realms of the ten directions, “Noble sons, are you not followers of the Great Vehicle?”

source: རིགས་ཀྱི་བུ་བདག་ཅག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་ཞུགས་ནས་ཡུན་རིང་ངོ་། །
en: “Noble son, we entered the path of unsurpassed, perfect, complete awakening a long time ago!”

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་འདོད་པ་རྣམས་འདུལ་བའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་གྱི་དབང་གིས་སེམས་ཅན་དམྱལ་བར་སྐྱེ་བ་ལ་བརྩོན་པ་ནི་གོར་མ་ཆག །དེ་བཞིན་དུ་བྱོལ་སོང་དང་། ཡི་དགས་དང་།
en: “Noble sons, because of their aspiration to ripen beings who must be tamed, those who are intent upon awakening are steadfast and do not hesitate to take birth among the hell beings.

source: རྙོག་པ་ལྔའི་སངས་རྒྱས་ཀྱི་ཞིང་དང་། གནོད་སྦྱིན་དབུལ་པོ་དང་། མི་དབུལ་པོ་དང་།
en: The same goes for taking birth in the animal realm, the preta realm, buddha realms inundated with the five impurities, and among poor yakṣas, poor humans, demons, and non-Buddhists who have fallen into different types of wrong views and are filled with doubts.

source: གཤེད་པོ་དང་། དེ་བཞིན་དུ་ལྟ་བ་ཐ་དད་པར་སོང་ཞིང་དོགས་པ་རྙེད་པའི་མུ་སྟེགས་ཅན་གཞན་ལ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སྨོན་ལམ་གྱི་དབང་གིས་དེར་སྐྱེ་བ་བླངས་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྩལ་པོ་ཆེ་ཞེས་སྨྲས་སོ། །
en: The fact that they take birth in those places due to their aspiration to tame beings is referred to as the bravery of the bodhisattvas.

source: ཇི་ལྟ་བུར་གནས་དེ་དང་དེ་དག་ཏུ་བརྩོན་འགྲུས་བརྟན་པ་ཕ་རོལ་གནོན་པས་ཉེ་བར་ཕྱིན་ཏོ། །
en: They go to places like that with firm diligence and great courage.

source: སེམས་ཅན་རྣམས་ནི་མི་ཤེས་པའི་རྩ་བ་དང་། ལྷན་ཅིག་ཏུ་འགྲོགས་པ། ཚེའི་དགོན་པར་ཡང་དག་པར་རྫོགས་པའི་ཞི་བའི་ལམ་རབ་ཏུ་ཉམས་པའོ། །
en: There are beings with the root of ignorance who congregate together, live in the forest their entire lives, and defile the path of perfect peace.

source: སེམས་ཅན་རྣམས་ནི་སྲོག་ཆགས་སུ་གྱུར་པ་ལ་མི་དགེ་བ་བཅུའི་ལས་ལ་བརྩོན་པའོ། །
en: These beings kill living creatures and diligently engage in the ten nonvirtuous actions.

source: ལྟ་བ་ངན་པ་རྫོགས་པ་དང་། འཇིག་རྟེན་ཕ་རོལ་གྱིས་འཇིགས་པ་མེད་པར་ལྟ་བ་དང་།
en: They perfect inferior views and are not afraid of the afterlife.

source: རྟག་པ་དང་ཆད་པར་ལྟ་བ་ཡང་དག་པར་རྫོགས་པའི་སེམས་ཅན་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་བདག་གི་ལུས་དང་སེམས་ཀྱི་སྡུག་བསྔལ་ལ་མོས་སོ། །
en: Bodhisattvas should resolve to undergo mental and physical suffering themselves out of pity for beings who perfect views of permanence and annihilation.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སེམས་ཅན་གཅིག་ཀྱང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་རབ་ཏུ་མོས་པར་ནུས་པ་དང་། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་ལས་ཀྱི་ལམ་གཅིག་གིས་ཀྱང་ས་བོན་བསྐྱེད་ཅིང་འདུག་པ་དང་།
en: A single being can be devoted to the six perfections in order to ripen all beings, a single action can cause one to plant the seed and remain on the path of the ten virtuous actions, and a single excellent statement can lead to comprehension.

source: ལེགས་པར་སྨྲ་བ་གཅིག་གིས་ཀྱང་རྣ་བར་གོ་བར་ནུས་པས་སེམས་ཅན་རེ་རེའི་ཕྱིར་ཡང་སྡུག་བསྔལ་རྣམ་པ་མང་པོ་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་རྣམ་པ་དུ་མ་སྣ་ཚོགས་སུ་མངོན་པར་བརྩོན་ནོ། །
en: Therefore, for the sake of every being, bodhisattvas diligently undergo many types of suffering for myriads of eons.

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གོ་ཆ་གཉིས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་གོ་ཆ་གང་གིས་བགོས་པ་ནི་བདུད་བཞི་འཛིན་ཅིང་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་ཀྱང་བྱའོ། །
en: “Noble sons, bodhisattvas have two types of armor, and the armor that bodhisattvas wear is what allows them to seize the four māras and be known as bodhisattvas.

source: གཉིས་གང་ཞེ་ན།
en: What are those two?

source: སེམས་ཅན་གྱི་གོ་ཆ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་གྱི་གོ་ཆའོ། །
en: The armor of beings and the armor of the qualities of the buddha realms.

source: རིགས་ཀྱི་བུ་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་ཅན་གྱི་གོ་ཆ་གང་ཞེ་ན།
en: Noble sons, what is the bodhisattvas’ armor of beings?

source: རིགས་ཀྱི་བུ་གང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཤིན་ཏུ་བརྟན་པའི་བརྩོན་འགྲུས་ཀྱིས་མོས་ཤིང་ཕ་རོལ་གནོན་པར་འགྱུར་བ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་བརྩོན་ཞིང་བྱམས་པ་བསྒོམས་པས་ཕོངས་པ་ཐམས་ཅད་དང་། མི་དགེ་བའི་རྩ་བ་དང་འགྲོགས་པ་དང་། མཚམས་མེད་པ་བྱེད་པ་དང་། དམ་པའི་ཆོས་སྤོང་བ་དང་།
en: Noble sons, bodhisattvas develop resolve and are courageous because of their steadfast diligence, and by exerting themselves in the six perfections and cultivating love, they ripen beings who are destitute, who involve themselves with the roots of nonvirtue, who commit the acts with immediate retribution, who reject the sacred Dharma, who denigrate the noble ones, and who are separated from the pure buddha realms.

source: འཕགས་པ་ལ་སྐུར་པ་འདེབས་པ་དང་། ཡོངས་སུ་དག་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ལས་དཀར་བའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །སྙིང་རྗེ་ཆེན་པོས་ལྟ་བར་སོང་བ་དྲུག་ཅུ་རྩ་གཉིས་ལས་ཡོངས་སུ་གྲོལ་བར་བྱེད་པ་བདག་གིས་ཀྱང་ཡང་དེ་བཞིན་དུ་སེམས་ཅན་ཉོན་མོངས་པའི་སྐྱབས་སུ་བསླབ་པར་བྱའོ། །
en: Bodhisattvas liberate beings from the sixty-two types of wrong views out of great compassion, so one should train to be a refuge for afflicted beings!

source: བསྡུ་བའི་དངོས་པོ་རྣམ་པ་བཞི་སྟེ། སྦྱིན་པ་དང་། ངག་སྙན་པ་དང་། དོན་བྱ་བ་དང་། དོན་འཐུན་པས་སེམས་ཅན་མགུ་བར་བྱའོ། །
en: You should gain their favor using the four means of attracting disciples—generosity, pleasant speech, altruistic actions, and consistency with the meaning!

source: སྦྱིན་པའི་བསྡུ་བའི་དངོས་པོས་སེམས་ཅན་མགུ་བར་བྱེད་པ་ནི་འདི་ལྟ་སྟེ། ཟས་དང་། སྐོམ་ནས་མགོའི་བར་དུ་སྦྱིན་པས་གང་སྦྱིན་པ་བྱིན་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་ཐབས་ལ་མཁས་པས་ཡོངས་སུ་བསྔོས་ཏེ། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: “Winning the favor of beings by using generosity as a means for attracting disciples refers to bodhisattvas who give some gift, from food and drink up to their own head, out of generosity and dedicate it using skillful means and thus master the six perfections.

source: གང་སྦྱིན་པ་བྱིན་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་ནི་མཚན་མ་ཡོངས་སུ་བྱིན་པ་འདི་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: When bodhisattvas who give a gift have given up on marks, this is the perfection of generosity.

source: གང་དེ་ནི་དངོས་པོ་ལ་དམིགས་པ་རབ་ཏུ་ཞི་བ་འདི་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: When they have pacified the observation of entities, this is the perfection of discipline.

source: གང་ཡུལ་ལ་མི་བཟོད་པ་མེད་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: When they are not impatient toward any object, this is the bodhisattva’s perfection of patience.

source: གང་དངོས་པོ་ཡོངས་སུ་བཏང་སྟེ། དབེན་པར་སྤྱོད་པའི་ཕྱིར་འབྱུང་བ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: When they give away their possessions and set out to practice in the wilderness, this is a bodhisattva’s perfection of diligence.

source: གང་དངོས་པོ་ཡོངས་སུ་བཏང་སྟེ་ལས་ཐམས་ཅད་ལ་ཀུན་ཏུ་མི་སྤྱོད་པ་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: When they give away their possessions and stop engaging in any activity, this is the bodhisattva’s perfection of concentration.

source: གང་དངོས་པོ་ཡོངས་སུ་སྦྱིན་པའི་ཕྱིར་བདག་གི་ཡིད་ལ་མི་སེམས་ཤིང་དངོས་པོ་དེ་ལ་དབེན་པར་སེམས་པ་ལ་རྣམ་པར་སྨིན་པར་མི་འདོད་པས་ལེན་པ་དང་། སྦྱིན་པ་གཉིས་མ་བྱུང་བ་རྣམ་པར་མི་རྟོག །ཀུན་ནས་མི་ལྡང་། དངོས་པོ་མེད། རྣམ་པར་བསལ་བ་མེད་པ་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའི་རང་བཞིན་མི་སྐྱེ་བའི་ཆོས་ཀྱི་བཟོད་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: When there is no sense of ownership due to giving something as a gift, and when no desire for anything in return for that thing occurs to one’s mind in solitude, this nonorigination, nonconceptual thought, nonarising, nonexistence, and lack of anything to be eliminated regarding both receiving and giving is a bodhisattva’s perfection of insight into the acceptance of the nonarising nature of phenomena.

source: ཡང་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་ལ་མཁས་པས་དོང་ཚེ་གཅིག་བྱིན་པས་ཀྱང་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཇི་ལྟར་ཡོངས་སུ་རྫོགས་པར་བྱེད། །
en: “How can the skillful means of a bodhisattva bring about mastery of the six perfections just by giving away a single coin?

source: རིགས་ཀྱི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་མཚན་མ་དང་ལྷན་ཅིག་པས་འདི་ལྟར་སློབ་སྟེ།
en: Noble sons, someone with the characteristics of a bodhisattva trains in the following way.

source: ལུས་མེད་པའི་ཕྱིར་ལོངས་སྤྱོད་ཆེན་པོའི་སྦྱིན་པ་རྣམ་པར་མི་སྒྲུབ།
en: They do not fixate on gifts that bring great pleasure because there is no body.

source: ལོངས་སྤྱོད་ཆེན་པོའི་རྒྱུར་སྦྱིན་པ་རྣམ་པར་མི་སྤོང་།
en: They do not reject a gift because it causes great pleasure.

source: ལོངས་སྤྱོད་ཆེན་པོའི་སྦྱིན་པ་ཡང་དག་པར་མི་ཤེས་ཏེ།
en: They do not perceive a gift that brings great pleasure.

source: རང་བཞིན་གྱིས་སྟོབས་འཛིན་པ་འདི་ཡང་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: Naturally possessing this power is the perfection of generosity.

source: གང་འདོད་པའི་ཁམས་ཀྱི་རྣམ་པར་སྨིན་པ་མི་འདོད་པས། སྦྱིན་པ་བྱིན་པའི་རྒྱུན་བཅད་པ་དང་།
en: “Since they do not wish for anything related to the desire realm in return, they cut the stream related to giving a gift.

source: དེ་བཞིན་དུ་གཟུགས་དང་གཟུགས་མེད་པའི་རྣམ་པར་སྨིན་པ་མི་འདོད་པས་སྦྱིན་པའི་རྒྱུན་བཅད་པ་དང་།
en: Likewise, they cut the stream related to generosity because they do not wish for anything in return related to the form or the formless realms.

source: བརྩོན་འགྲུས་ཀྱིས་མཚན་ཉིད་ལ་མི་འཇུག་པ་དང་། དྲན་པའི་སྟོབས་མི་སྐྱེ་མི་འགོག་པ་ལ་དམིགས་པས་སྦྱིན་པ་བྱིན་པ་འདི་ཡང་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །གང་སྦྱིན་པ་ནི་གཡེང་བའི་མཚན་ཉིད་དང་། དྲན་པའི་ཡུལ་ལ་ཡང་དག་པར་རྒྱས་པ་དང་།
en: Giving a gift while diligently avoiding engaging characteristics and focusing on the unborn and unceasing power of recollection is the perfection of discipline.

source: ལེན་པ་དང་དོར་བ་མེད་པའི་རང་བཞིན་ཅན་གྱི་ཡུལ་ལ་མི་ཁོམ་པར་དམིགས་ཤིང་སྙེམས་པ་མེད་པ་འདི་ནི་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །གང་ཡང་སྦྱིན་པ་དེ་དམིགས་པ་ཐམས་ཅད་ཀུན་ལྡང་བ་དྲན་པ་ཉེ་བར་གཞག་པའི་ཡེ་ཤེས་དང་། རྣམ་པར་སྤྱོད་པས་ལམ་མི་འཐུན་པ་ཡོངས་སུ་སྤངས་པའི་ཡེ་ཤེས་དང་།
en: “Generosity that is devoid of conceit and focuses continuously on its object—the natural absence of the characteristics of distraction, of elaboration with respect to the object of recollection, and of acceptance and rejection—is the perfection of patience.

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ལམ་ལ་རེག་པ་མེད་པའི་ཡེ་ཤེས་དང་། དམའ་ཞིང་རབ་ཏུ་ཉམས་པའི་ལམ་དང་། ཚིག་པས་གདུངས་པ་རྣམས་སྙིང་རྗེ་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་བསྐྱབས་ཏེ་ཞི་བའི་ལམ་དུ་བཞག་པ་དང་། དབེན་པར་སྤྱོད་པ་ལ་བདག་བདེ་བ་སྐྱེད་ཅིང་ཐེག་པ་ཆེན་པོ་ཡོངས་སུ་བཟུང་བའི་ཕྱིར་སྦྱིན་པ་བྱིན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: “Generosity that is the wisdom that applies mindfulness of the continual arising of all forms of apprehension; the wisdom that abandons practices that are in disharmony with the path; the wisdom that is disconnected from the paths of the hearers and the solitary buddhas; entirely out of compassion, protecting those who follow inferior and corrupted paths and are tormented by anger and establishing them on the path of peace; and giving a gift so that they may embrace the Great Vehicle because it brings one joy while practicing in the wilderness is a bodhisattva’s perfection of diligence.
